[
  {
    "title": "Akshan Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/akshan-3-1024x317.png",
    "text": "How to Play: Since this is a 3 cost reroll comp, ideally you try to level to 7 and slowroll for 3*. However, to get there, try to play strongest board and/or build your economy through interest thresholds so that you can set yourself up for success. Sometimes, if your board is weak early, you probably want to sack (lose streak) the entirety of Stage 2 and the first half of Stage 3. Then, level to 7 at 3-5 with the economy you’ve built to roll for 2* Akshan and some other upgrades like Lissandra 2. If you have a Last Whisper, Freljord is not completely necessary, but since Lissandra is typically rerolled along with Akshan you might as well keep it. Augments: Shurima’s Legacy, Long Distance Pals, Unified Resistance, Cybernetic Leech, Cruel Pact, Golden Ticket, Final Ascension, Social Distancing, Cybernetic Leech I, Army Building"
  },
  {
    "title": "Ravenous Hunter Warwick",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/ww-1024x318.png",
    "text": "How to Play: Since this is a primarily 2 cost reroll comp, you should build you economy up early by hitting your 10 gold intervals as fast as possible and prepare to level to 6 at Stage 3-2 to roll for 2* upgrades of your units. Then, you should build your economy back up and slowroll above 50g while maintaining max interest for 3* Warwick. If you get a lot of copies of Sett you might as well try to 3* him as well, but keep in mind that Warwick is by far the highest priority unit. Sett is not as important. If you hit Warwick faster than Sett and you are far from Sett 3*, look to level up to add in Yasuo and Kai’Sa eventually. Augments: Ravenous Hunter, Buried Treasures, Golden Ticket, Think Fast, Scoped Weapons, Long Distance Pals, Blood Money, Pandora’s items,  Transfusion"
  },
  {
    "title": "Jinx Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/jinx-1-1024x312.png",
    "text": "How to Play: Since this is a primarily 2 cost reroll comp, you should build you economy up early by hitting your 10 gold intervals as fast as possible and prepare to level to 6 at Stage 3-2 to roll for 2* upgrades of your units. Then, you should build your economy back up and slowroll above 50g while maintaining max interest for 3* Jinx and Vi. Runaan’s Hurricane can now proc off of Jinx’s ult so it’s pretty important to have that item. Level up for 4 Zaun and 4 Gunner eventually. Augments: Golden Ticket, Think Fast, Slayer Emblem, Slayer Crown, Long Distance Pals, Idealism, Vampiric Blades, Slayer Heart, Pandora’s Items"
  },
  {
    "title": "Sorcerers",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/Sorc-1024x311.png",
    "text": "How to Play: Since your carry is Lux, which is a 4 cost, you must learn to navigate the early game with an AP focused carry. That could be Malzahar, Cassiopeia, Vel’Koz, etc until you find a Lux. Try to play a strong board early game to get to level 7 safely. Otherwise, if your early board is weak, try to lose streak to build econ. At Stage 4-1, if your HP is low and you are not that rich, look to roll down for at least 1 Lux and 2* copies of your Sorceror units. Your late game should involve Lux and Ahri duo carry. Augments: Buried Treasures, Sorceror Crown, Sorceror Emblem, Magic Wand, Long Distance Pals, Healing Orbs, Unified Resistance, Pandora’s Items,"
  },
  {
    "title": "Shadow Isles",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/kalista-rr-1024x305.png",
    "text": "How to Play: If you have attack speed items and/or an early Kalista 2*, you can look to play this comp as it performs rather well. You don’t necessarily need a Kalista 3, but it definitely helps. Look to roll at level 7 for Kalista 2, Gwen and your other units, and decide if it’s worth staying at level 7 to look for Kalista 3 or econning up and pushing levels. Augments: Shadow Isles Crown, Healing Orbs I, Cybernetic Leech, March of Progress, Golden Ticket, Social Distancing, Unified Resistance"
  },
  {
    "title": "Gunners",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/gunners-1024x304.png",
    "text": "How to Play: This comp is the other flexible AD comp, and usually is a result of having an early Gunner start, whether it be through units or augments or both. Zeke’s Herald is a good item in this comp because it stacks AD quicker, but make sure you have a good frontline to buy time for your Gunners to scale. Once again, early game item holders are Jhin, Tristana and Ashe as far as 1 and 2 cost units go, and make sure to play around whatever upgraded frontline you can get until you get to Sej/Shen. Late game you typically play 4 Gunner + tanks. Augments: Dueling Gunners, Teaming Up, Cybernetic Leech, You Have My Sword, Harmacist, Pandora’s Items, Red Buff"
  },
  {
    "title": "Noxus Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/noxus-rr-1312-1024x303.png",
    "text": "How to Play: Noxus is a bit more reliant on having a strong Noxus opener because of the importance of securing stacks. If you can get stacks early it snowballs your game into a spot where you winstreak, gain a lot of econ and have a lot of safety rolling for your 3* Darius and Katarina. What’s nice about this comp is that you can split your AP and AD items amongst your duo carry, and the only real dependence this comp has is to play off of a Noxus opener. When you hit your 3* units, look to put in useful 5 costs such as Aatrox and Ryze if his variant is good. Augments:"
  },
  {
    "title": "Taliyah (Double Trouble) Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/dt-tali-1024x316.png",
    "text": "How to Play: This is mainly played with the Double Trouble augment, so if you happen to see it at 2-1 you should consider playing this comp. Since this is a primarily 2 cost reroll comp, you should build you economy up early by hitting your 10 gold intervals as fast as possible and prepare to level to 6 at Stage 3-2 to roll for 2* upgrades of your units. Then, you should build your economy back up and slowroll above 50g while maintaining max interest for 3* Taliyah and Sett. If you get a lot of copies of Teemo you should go for it as well so you can get Double Trouble value on him as well. Augments: Golden Ticket, Think Fast, Long Distance Pals,"
  },
  {
    "title": "Challengers",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/Challengers-1024x323.png",
    "text": "How to Play: Much like Duelists of Set 8, Challengers is a high tempo comp. It is important to establish a strong early game as you may not be able to beat out top comps that have infinite stall. However, if you can upgrade your carries early and can push a winstreak, this comp can do very well, especially if you have items for both Yasuo and Kai’Sa. Locket of the Iron Solari is very good in this comp because of its heavy emphasis on damage and lack of survivability. Augments:"
  },
  {
    "title": "Void Kai’Sa",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/void-1312-1024x324.png",
    "text": "How to Play: Void seems to be a rather simple comp that relies on getting a Void start early game. If you get an early 2* Cho’Gath and/or Malzahar and can get a +1 Void augment, then all you need to do is just go for 3 and then 6 Void ASAP. The entire premise of this comp is to get to Kai’Sa with a decent amount of HP, then scale into 6 or even 8 Void lategame with upgraded high cost units like Bel’Veth, Sion, Kai’Sa and Sejuani. Augments: Void augments"
  },
  {
    "title": "Built Different",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/Built-Diff-1024x316.png",
    "text": "How to Play: To play this, obviously you don’t want any units with traits in, so the most important thing is playing high quality units. Early game, usually this means just any traitless upgraded units, but as you approach midgame, look to use 3 costs to carry your offensive and defensive items. For example, Akshan can carry AD items and Karma can carry AP items. Late game will involve a LOT of 2* 4 cost units, so it’s important to build our economy well early game to set ourselves up for success. Augments: Built Different, Long Distance Pals, Jeweled Lotus, Social Distancing, Unified Resistance, Buried Treasures, Double Trouble"
  },
  {
    "title": "Yasuo Ionia",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/yasuo-1024x331.png",
    "text": "How to Play: Generally to play this comp you typically transition from a partial Ionia start into a full Ionia board or from Challengers. Since your carries and your most important units are 4 costs, it’s important to play a strong early game, build economy and then get your endgame board online either at level 7 or 8. Yasuo needs a lot of bruiser items as he tends to die quite often, so often you want Bloodthirster + Titan’s Resolve and/or Edge of Night. You should look for a secondary carry, so if you have leftover Attack Speed AD items look to slot in Aphelios, whereas if you have more AP centered items look to slot in Kai’Sa or Lux. Augments: Ionia Crown, Level Up, Jeweled Lotus, Sentinel Spirit, Gifts from the Fallen, Long Distance Pals, Unified Resistance, Battle Ready, Cybernetic Leech"
  },
  {
    "title": "Strategist Azir/Lux",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/strategist-azir-1024x329.png",
    "text": "How to Play: Generally to play this you play with any early AP or attack speed user and slam good early game items such as Statikk Shiv and Guinsoo’s Rageblade. With the Draven legend nerfs, the meta will most likely revert back to a roll at level 7 meta, so it is important to try to keep high economy and/or HP to make it to Stage 4-1 with enough gold to roll for at least 1* copies of your carries. Early game, try to hold Strategist units, especially  Swain. A Swain 2 can stabilize your midgame pretty easily and  your backline carries could range anything from Cassiopeia to Multicasters to Sorcerers early game. Augments: Shurima’s Legacy, Social Distancing, Level Up, Jeweled Lotus, Gifts from the Fallen, Long Distance Pals, Unified Resistance, Battle Ready, Cybernetic Leech"
  },
  {
    "title": "Deadeye",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/Deadeye-1024x311.png",
    "text": "How to Play: Aphelios seems to be one of, if not, the most reliable AD flex comps right now. Since general flex play oftentimes results in a 2* 4 cost carry, Aphelios is very popular for those who pursue an AD line. Look for good early game AD item holders like Jhin, Tristana and Ashe and play flexibly around what frontline upgrades you have, whether it be Bruiser, Bastion, Demacia, etc. Late game you can play the standard board shown above but sometimes you will find more useful upgrades than 4 Deadeye, or important 5 cost units, but the core of this comp is Aphelios, Sejuani, Shen and Urgot. Augments: Teaming Up, You Have My Sword, You Have My Bow, Harmacist, Level Up, Red Buff, Healing Orbs, Pandora’s Items,"
  },
  {
    "title": "Tristana Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/Yordles-1024x334.png",
    "text": "How to Play: GameplaySince Yordles is a 1 cost reroll comp, it is almost always recommended to slowroll at level 5 above 50 gold for your 3* units. However, it is very dependent on how many 1 cost units you have. The highest priority 3* units are Maokai, Tristana, and Poppy so if you get those to 3* early while not being close to 3 starring your other units, it’s best to push levels to find Heimerdinger. Augments: Golden Ticket, Radiant Relics, Think Fast, Social Distancing, Long Distance Partners, Morning Light, Healing Orbs, On a Roll, Harmacist"
  },
  {
    "title": "Multicaster Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/Multicaster-1-1024x328.png",
    "text": "How to Play: This comp is incredibly strong if you hit your 3* Sona + Vel’Koz and have good augments. Like any other 3 cost reroll comp, ideally we want to get our 2* 3 cost units at level 7 and then build our economy back up to above 50g (max interest) to slowroll for our 3* units. It is important to play your early game in a way that preserves HP and gold in the most efficient way possible. If needed, roll at  6 for upgrades/units to avoid taking too much damage in Stage 3. Augments: Golden Ticket, Think Fast, Jeweled Lotus III, Perfected Repitition, Unified Resistance, Magic Wand, On a Roll, Pandora’s Items"
  },
  {
    "title": "Shurima",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/shurima-1312-1024x307.png",
    "text": "How to Play: With Azir as an AP + Attack Speed based carry, you can flex between Shurima and Kai’Sa Void comps since their items are very similar. If you have a heavy Shurima start or you get an early Azir, you can look to pivot or commit to Shurima. Since it is a vertical (high # Synergy) comp, it is simple to play, just make sure you as many Shurima as you can. Make sure to play strongest board until you can reach your 5/7 Shurima. Augments:"
  },
  {
    "title": "Kayle Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/kayle-1024x319.png",
    "text": "How to Play: GameplaySince Kayle is a 1 cost reroll comp, it is almost always recommended to roll to 30g at 3-1 at level 4 for as many copies of the Kayle, Maokai and Poppy as possible. You don’t even have to upgrade Galio and Kled yet. Then, try to build your economy back up and slowroll at level 5 above 50 gold for your 3* units.  The obvious highest priority 3* units are Kayle, Poppy and Maokai. Once you 3* those units, level up to add in Yordle and keep leveling up to add in more Slayers. Augments: Golden Ticket, Tiniest Titan, Transfusion, Think Fast,  Long Distance Partners, Morning Light, On a Roll, All That Shimmers, Slayer Heart, Silver Ticket, Bronze Ticket, Blood Money"
  },
  {
    "title": "Ekko Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/Ekko-1024x329.png",
    "text": "How to Play: If you get a Piltover early and have AP items, look to play this comp. Like any other 3 cost reroll comp, ideally we want to get our 2* 3 cost units at level 7 and then build our economy back up to above 50g (max interest) to slowroll for our 3* units. It is important to play your early game in a way that preserves HP and gold in the most efficient way possible. If needed, roll at  6 for upgrades/units to avoid taking too much damage in Stage 3. Ekko 2* with Jeweled Gauntlet and Hand of Justice should stabilze for a bit, but to contest top comps late game obviously we need 3*. The reason we want two Hand of Justices is because of the extra Omnivamp potential and the extra damage, of course. Augments: Golden Ticket, On a Roll, Jeweled Lotus, Idealism, March of Progress, Cybernetic Leech, Unified Resistance, Harmacist"
  },
  {
    "title": "Karma Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/karma-reroll-1024x342.png",
    "text": "How to Play: Since this is primarily a 3 cost reroll comp, our main objective is to go to level 7 either healthy and/or with good economy. Because we want 3* Karma, 3* Lissandra and ideally 3* Taric, we will need a lot of resources to help us hit our units. Use Cassiopeia early game as your Karma item holder, and play flexibly around frontline/utilty units. You can play around Brawlers, Bastions, or whatever else early game and then pivot into the final board that you see above. 3* units are very important, so try to hit those before pushing level 8. Augments: Golden Ticket, March of Progress, Social Distancing, Loving Invocation, Magic Wand, Trade Sector, Pandora’s Items, Unified Resistance, Rolling for Days"
  },
  {
    "title": "Riftwalker Kassadin",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/Kassadin-1024x316.png",
    "text": "How to Play: Since the only unit we’re looking to 3* is a 2 cost, you should build you economy up early by hitting your 10 gold intervals as fast as possible and prepare to level to 6 at Stage 3-2 to roll for 2* upgrades of your units. Then, you should build your economy back up and slowroll above 50g while maintaining max interest for 3* Kassadin. After you hit, look to add in more Bastions while you level up. Augments: Golden Ticket, Think Fast, Long Distance Pals, Transfusion, Bastion Crest, Healing Orbs, Unified Resistance, Buried Treasures"
  },
  {
    "title": "Zed Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/07/zed-1024x316.png",
    "text": "How to Play: Since this is a primarily 2 cost reroll comp, you should build you economy up early by hitting your 10 gold intervals as fast as possible and prepare to level to 6 at Stage 3-2 to roll for 2* upgrades of your units. Then, you should build your economy back up and slowroll above 50g while maintaining max interest for 3* Zed. If you get a lot of copies of Kled and Sett you might as well try to 3* them as well, but keep in mind the main carries of this comp are Zed and Katarina. Augments: Golden Ticket, Think Fast, Slayer Emblem, Slayer Crown, Long Distance Pals, Idealism, Vampiric Blades, Slayer Heart, Pandora’s Items"
  },
  {
    "title": "Rogue Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/rogue-reroll-2-1024x307.png",
    "text": "How to Play: Even though Rogue did get a bit of a nerf early on in PBE, it is decently strong due to the snowball nature of these units. If you’re in a rough spot early game, look to roll at level 6 to hit your upgrades, but since Katarina and Ekko are both 3 costs, it would make sense to slowroll above 50g for your 3* units, however that situation is only allowed if you are highrolling. Augments: Golden Ticket, On a Roll, Think Fast, Cybernetic Leech, Gifts From Above, Radiant Relics"
  },
  {
    "title": "Garen Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/Garen-juggernaut-1024x337.png",
    "text": "How to Play: Since this is a 3 cost reroll comp, ideally you try to level to 7 and slowroll for 3*. However, to get there, try to play strongest board and/or build your economy through interest thresholds so that you can set yourself up for success. Sometimes, if your board is weak during stage 3, it’s important to roll and stabilize for 4 Juggernaut 3 Demacia at level 6. Sona is a good Morellonomicon applier, and is good to 3* to also serve as utility for your Garen. It is ideal to start winstreaking stage 3 to set yourself economically at level 7! Then, when you level to level 8 or 9, depending on your HP and econ, look for Aatrox and put in 6 Juggernauts. Augments: March of Progress, Pumping Up, Golden Ticket, You Have My Sword, Petricite Shackles, Adrenaline Rush, Pandora’s Items, Cybernetic Leech, Battle Ready"
  },
  {
    "title": "Demacia",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/demacia-1312-1024x306.png",
    "text": "How to Play: Much like Void, Demacia comp is easier to play with a Demacia opener. Otherwise, you might have to be a bit more creative with your early game to pivot into it later .Early game, you can use a 2* 1 cost AP champion like Cassiopeia or Malzahar to carry lux items. Midgame you can then use Sona to carry these items with 5 Demacia until you find Lux. Any Bruiser/AD items can just go on Jarvan IV. Lategame, look to add in useful 5 cost units like Heimerdinger, Aatrox, Ryze and Ahri. If you reach level 9, look to drop Kayle and Sona for 5 Demacia to add in some of these units. Augments:"
  },
  {
    "title": "Teemo Reroll",
    "img": "cdn-5fad0894c1ac1813b0e8209c.closte.com/wp-content/uploads/2023/06/Teemo-1024x338.png",
    "text": "How to Play: Since this is primarily a 2 cost reroll comp, we should look to 3* our units at level 6 for the best odds. This means that we will build our economy until we hit level 6 and then roll down for 2* units to stabilzie our board, Look to put in 4 Multicaster after hitting your yordles. Augments: Golden Ticket, Think Fast, Jeweled Lotus III, Trade Sector, Magic Wand, Harmacist, Pandora’s Items, On a Roll"
  }
]